user_month = int(input("Введите месяц в виде целого числа от 1 до 12: "))
# -----------------Решение с использованием списка------------
months = ("зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень", "осень", "зима")
print(months[user_month - 1])

# -----------------Решение с использованием словаря------------
months = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна",
          6: "лето", 7: "лето", 8: "лето", 9: "осень", 10: "осень", 11: "осень", 12: "зима"}
print(months[user_month])
